In [1]:
import numpy as np
import pandas as pd

In [3]:
def sayhello(name='mary',age='18'):        #參數裡可設定預設值
    print("Hi! "+name+" your age is "+age)

sayhello('jack','16')

Hi! jack your age is 16

In [19]:
def num(number):
    number*=number*2
    return number

x=num(65)
print(type(x))
print(x)

<class 'int'>
8450

In [11]:
def outputstar(n):
    for i in range(n):
        print('*'*(n-i))

In [12]:
outputstar(5)

*****
****
***
**
*

###  * args / **kwargs prac

#####  *args

In [13]:
def foo(*tmp):    # 加上星號，不用設定多少參數
    print(tmp)

foo('a','b','c') #直接印出要求的內容

('a', 'b', 'c')

In [17]:
def sum(*args):
    print(type(args))
sum()

<class 'tuple'>

In [18]:
def sum2(*args):
    total=0
    for arg in args:
        total+=arg
    print(total)
    
sum2(1,2,3,4)  #可以加入無限個參數

10

#####  **kwargs

In [21]:
def print_address(**kwargs):
    print(type(kwargs))

print_address(street="123 Fake St.",
              pobox="P.O Box 777",
              city="Detroit",
              state="MI",
              zip="54321")

<class 'dict'>

In [25]:
def print_ad(**kwargs):
    for key,value in kwargs.items():
        print(f"{key} : {value}")

print_ad(street="123 Fake St.",
          pobox="P.O Box 777",
          city="Detroit",
          state="MI",
          zip="54321")

street : 123 Fake St.
pobox : P.O Box 777
city : Detroit
state : MI
zip : 54321

#### * args and ** kwargs exercise

In [33]:
def shipping_label(*args, **kwargs):
    for arg in args:
        print(arg, end=" ")
    print()
    
    if "apt" in kwargs:
        print(f"{kwargs.get('street')} {kwargs.get('apt')}")
        
    elif "pobox" in kwargs:
        print(f"{kwargs['street']} &  {kwargs.get('pobox')}")
        
    else:
        print(f"{kwargs.get('street')}")

        
    print(f"{kwargs.get('city')}, {kwargs.get('state')} {kwargs.get('zip')}")

shipping_label("Dr.", "Spongebob", "Squarepants", 
               street="123 Fake St.",  pobox="PO box #1001",  city="Detroit",  state="MI",zip="54321")

Dr. Spongebob Squarepants
123 Fake St. &  PO box #1001
Detroit, MI 54321

## Numpy

In [24]:
lst1=[1,2,3,4,5]
lst2=[6,7,8,9,10]
np1=np.array(lst1)

In [23]:
a=[1,2,3,4,5,6,7]
lsw=np.array(a)
type(lsw)
print(lsw.dtype)

int32

In [18]:
np2=np.array([1,2,3]) # np.array()內要放list作為參數

In [19]:
print(type(np1))
print(np1.dtype)
print(np1)
np1

<class 'numpy.ndarray'>
int32
[1 2 3 4 5]

array([1, 2, 3, 4, 5])

In [28]:
temp=np1.astype(np.float64)
print(temp.dtype)
print(temp)

float64
[1. 2. 3. 4. 5.]

### 將一維資料轉為二維資料

In [31]:
tp=[2,3,4,5]
np2=np.array(tp)
np2=np2.reshape((2,2))
print(np2)

tp2=[2,3,6,8]
np3=np.array(tp2)
np3=np3.reshape((2,2))
print(np3)

[[2 3]
 [4 5]]
[[2 3]
 [6 8]]

In [33]:
np2.dot(np3)

array([[16, 21],
       [28, 37]])

### Pandas

In [35]:
df=pd.read_csv('https://raw.githubusercontent.com/Code-Gym/python-dataset/master/u.user.txt',sep='|',index_col='user_id')

In [36]:
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [37]:
df.shape

(943, 4)

In [38]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [39]:
df['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [40]:
df['occupation'][1]

'technician'

In [41]:
df['occupation'].nunique() # n unique

21

In [44]:
df['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [45]:
df.describe() # 只會計算欄位是數值的資料

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [53]:
df.describe(include='all') # 讓非數值欄位也可以有計算結果

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### 使用append合併資料

In [15]:
df1=pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'],
                   'B':['B0', 'B1', 'B2', 'B3'],
                   'C':['C0', 'C1', 'C2', 'C3'],
                   'D':['D0', 'D1', 'D2', 'D3']},
                  index=[0,1,2,3])
df2 = pd.DataFrame({'A':['A4', 'A5', 'A6', 'A7'],
                   'B':['B4', 'B5', 'B6', 'B7'],
                   'C':['C4', 'C5', 'C6', 'C7'],
                   'D':['D4', 'D5', 'D6', 'D7']},
                  index = [4, 5, 6, 7])

df1.append(df2) # df1 本身並不會改變

C:\Users\maztl\AppData\Local\Temp\ipykernel_6916\283733847.py:12: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2) # df1 本身並不會改變

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [16]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [17]:
df3 = pd.DataFrame({'A':['A8', 'A9', 'A10', 'A11'],
                   'B':['B8', 'B9', 'B10', 'B11'],
                   'C':['C8', 'C9', 'C10', 'C11'],
                   'D':['D8', 'D9', 'D10', 'D11']},
                  index=[8, 9, 10, 11])
df1.append([df2,df3]) # df1 本身並不會改變

C:\Users\maztl\AppData\Local\Temp\ipykernel_6916\1431809211.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append([df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [18]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [19]:
df4 = pd.DataFrame({'B':['B2', 'B3', 'B6', 'B7'],
                   'D':['D2', 'D3', 'D6', 'D7'],
                   'F':['F2', 'F3', 'F6', 'F7']},
                  index = [2, 3, 6, 7])
df1.append(df4,ignore_index=True) # df1 本身並不會改變，會自動補齊columns

C:\Users\maztl\AppData\Local\Temp\ipykernel_6916\853395801.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df4,ignore_index=True)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

### 新增一筆新的資料，用append

In [22]:
df1=df1.append({'A':'A4','B':'B4','C':'C4','D':'D4'},ignore_index=True) # df1 本身並不會改變，除非先指向自己
df1

C:\Users\maztl\AppData\Local\Temp\ipykernel_6916\3280253685.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1=df1.append({'A':'A4','B':'B4','C':'C4','D':'D4'},ignore_index=True) # df1 本身並不會改變，除非先指向自己

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A4  B4  C4  D4

### 使用concat合併資料

In [23]:
df1=pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'],
                   'B':['B0', 'B1', 'B2', 'B3'],
                   'C':['C0', 'C1', 'C2', 'C3'],
                   'D':['D0', 'D1', 'D2', 'D3']},
                  index=[0,1,2,3])
df2 = pd.DataFrame({'A':['A4', 'A5', 'A6', 'A7'],
                   'B':['B4', 'B5', 'B6', 'B7'],
                   'C':['C4', 'C5', 'C6', 'C7'],
                   'D':['D4', 'D5', 'D6', 'D7']},
                  index = [4, 5, 6, 7])
df3 = pd.DataFrame({'A':['A8', 'A9', 'A10', 'A11'],
                   'B':['B8', 'B9', 'B10', 'B11'],
                   'C':['C8', 'C9', 'C10', 'C11'],
                   'D':['D8', 'D9', 'D10', 'D11']},
                  index=[8, 9, 10, 11])
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [10]:
df4 = pd.DataFrame({'B':['B2', 'B3', 'B6', 'B7'],
                   'D':['D2', 'D3', 'D6', 'D7'],
                   'F':['F2', 'F3', 'F6', 'F7']},
                  index=[2, 3, 6, 7])
pd.concat([df1,df4],axis=1,join='outer',sort=False)

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [16]:
pd.concat([df1,df4],axis=1,join='inner',sort=False)

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [17]:
pd.concat([df1,df4],axis=0,join='inner')

    B   D
0  B0  D0
1  B1  D1
2  B2  D2
3  B3  D3
2  B2  D2
3  B3  D3
6  B6  D6
7  B7  D7

## 群組化索引值
keys=\['次索引值1', '次索引值2', ...\]

In [19]:
result=pd.concat([df1,df2,df3],keys=['x','y','z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [22]:
result.loc['y']

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

# 基於特定欄位合併資料merge
* 左邊DataFrame.merge(右邊DataFrame, on='key欄位')
* 如果沒有指定key欄位，兩個dataframe重複的欄位將會被指定為key欄位

In [24]:
left = pd.DataFrame({'key':['K0', 'K1', 'K2', 'K3'],
                    'A':['A0', 'A1', 'A2', 'A3'],
                    'B':['B0', 'B1', 'B2', 'B3']})
print(left)
right = pd.DataFrame({'key':['K0', 'K1', 'K2', 'K3'],
                     'C':['C0', 'C1', 'C2', 'C3'],
                     'D':['D0', 'D1', 'D2', 'D3']})
print(right)

left.merge(right,on='key')

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [25]:
left = pd.DataFrame({'key1':['K0', 'K0', 'K1', 'K2'],
                    'key2':['K0', 'K1', 'K0', 'K1'],
                    'A':['A0', 'A1', 'A2', 'A3'],
                    'B':['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1':['K0', 'K1', 'K1', 'K2'],
                     'key2':['K0', 'K0', 'K0', 'K0'],
                     'C':['C0', 'C1', 'C2', 'C3'],
                     'D':['D0', 'D1', 'D2', 'D3']})

In [26]:
left.merge(right,on=['key1','key2']) #預設是 inner join

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [27]:
left.merge(right,on=['key1','key2'],how='left')

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [28]:
left.merge(right,on=['key1','key2'],how='right')

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [29]:
left.merge(right,on=['key1','key2'],how='outer')

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [30]:
left.merge(right,on=['key1','key2'],how='inner') # 預設的

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [31]:
left.merge(right,on=['key1','key2'],how='outer',indicator=True)

  key1 key2    A    B    C    D      _merge
0   K0   K0   A0   B0   C0   D0        both
1   K0   K1   A1   B1  NaN  NaN   left_only
2   K1   K0   A2   B2   C1   D1        both
3   K1   K0   A2   B2   C2   D2        both
4   K2   K1   A3   B3  NaN  NaN   left_only
5   K2   K0  NaN  NaN   C3   D3  right_only

In [32]:
left.merge(right,on='key1') # key2會重新命名

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K0     K1  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K0  C1  D1
3   K1     K0  A2  B2     K0  C2  D2
4   K2     K1  A3  B3     K0  C3  D3

In [33]:
left.merge(right,on='key1',suffixes=('_left','_right'))

  key1 key2_left   A   B key2_right   C   D
0   K0        K0  A0  B0         K0  C0  D0
1   K0        K1  A1  B1         K0  C0  D0
2   K1        K0  A2  B2         K0  C1  D1
3   K1        K0  A2  B2         K0  C2  D2
4   K2        K1  A3  B3         K0  C3  D3